/*REXX*/                              
SAY ENTER TWO NUMBERS                 
PULL A                                
PULL B                                
C=A%B                                 
SAY 'THE QUOTIENT INTEGER PART IS:' C 
D=A//B                                
SAY 'THE REMAINDER INTEGER PART IS:'D 
E=A**B                                
SAY 'A RAISE TO POWER B IS:' E        