/*rexx*/
/*30
20 40 d
60*/

a=30
b=40
call sum1 a,b
say a b d
say result
return 
sum1:
procedure expose a b
arg e,f
say a
a=20
d=a+f
return d

